STMicroelectronics/STM32CubeH7RS/Projects/NUCLEO-H7S3L8/Applications/USB_Device/Composite_CDC_HID_Standalone/Appli/Src/usbd_conf.c
        /* return pointer to allocated region. */
        return (void *)( &memory_pool->pages[start][0]);
      }
      else
      {
        start = index;
      }
    }
  }

  return NULL;

}

/**
  * @brief  Dummy memory free
  * @param  p: Pointer to allocated  memory address
  * @retval None
  */
void USBD_static_free(void *p)
{
  __IO uint8_t index;
  uint8_t counter, start;

  /* Handle NULL pointers */
  if (p == NULL)
    return;

  /* Find start Index */
  uint8_t * address_start = (uint8_t*)p;
  uint32_t byte_position_in_pages =  (uint32_t)(address_start - &memory_pool->pages[0][0]);
  start = (uint8_t)( byte_position_in_pages / sizeof(memory_pool->pages[0]));

  if (byte_position_in_pages > sizeof(memory_pool->pages))
  {
    Error_Handler();
  }

  /* Retrieve segment size */
  counter = memory_pool->size[start];

  /* Set size to zero */
  memory_pool->size[start] = 0U;

  /* Deallocate memory region */
  for (index = 0; index < counter; index++)
  {
    memory_pool->PageTable[start + index] = 0U;
  }

  return;
}

/**
  * @brief  Returns the USB status depending on the HAL status:
  * @param  hal_status: HAL status
  * @retval USB status
  */
USBD_StatusTypeDef USBD_Get_USB_Status(HAL_StatusTypeDef hal_status)
{
  USBD_StatusTypeDef usb_status = USBD_OK;

  switch (hal_status)
  {
    case HAL_OK :
      usb_status = USBD_OK;
    break;
    case HAL_ERROR :
      usb_status = USBD_FAIL;
    break;
    case HAL_BUSY :
      usb_status = USBD_BUSY;
    break;
    case HAL_TIMEOUT :
      usb_status = USBD_FAIL;
    break;
    default :
      usb_status = USBD_FAIL;
    break;
  }
  return usb_status;
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */